app/Repositories/ProjectRepository.php

    public function createProject($dataProject) {
        return $this->model->create($dataProject);
---
insert into `projects` (`name`, `describes`, `status`, `is_exist`, `updated_at`, `created_at`) values ('Võ Văn Quá', 'uuu', 'open', 1, '2024-03-19 07:11:53', '2024-03-19 07:11:53')

    public function getAllIsExist(){
        $isExist = true;
        return $this->model->with("userProjects")->whereHas("userProjects",function($q) use($isExist){
            $q->where("is_exist",$isExist);
        })->get();
---
select * from `projects` where exists (select * from `user_project` where `projects`.`id` = `user_project`.`project_id` and `is_exist` = 1)