app/Repositories/TaskRepository.php

select * from `tasks` where exists (select * from `user_task` where `tasks`.`id` = `user_task`.`task_id` and `project_id` = '10')
---
    public function getAllTask($id){
        return $this->model->with("userTasks")->whereHas("userTasks",function($q) use($id){
            $q->where("project_id",$id);
        })->get();